RoboEvangelist/TivaWare_C_Series-2.1.0.12573/examples/boards/ek-tm4c1294xl-boost-cc3000/cc3000_basic_wifi_application/cc3000_basic_wifi_application.c
//*****************************************************************************
//
// basic_wifi_application.c - A command-line driven CC3000 WiFi example.
//
// Copyright (c) 2014 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.0.12573 of the EK-TM4C1294XL Firmware Package.
//
//*****************************************************************************
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <math.h>
#include "PWM_10-30.h"
#include "inc/hw_types.h"
#include "driverlib/timer.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/systick.h"
#include "driverlib/fpu.h"
#include "driverlib/debug.h"
#include "utils/ustdlib.h"
#include "utils/uartstdio.h"
#include "utils/cmdline.h"
#include "driverlib/uart.h"
#include "driverlib/ssi.h"
#include "inc/hw_types.h"
#include "driverlib/fpu.h"
#include "inc/hw_memmap.h"
#include "inc/hw_gpio.h"
#include "driverlib/sysctl.h"
#include "driverlib/pin_map.h"
#include "driverlib/gpio.h"
#include "driverlib/debug.h"
#include "driverlib/pwm.h"
#include "driverlib/pin_map.h"
#include "inc/tm4c1294ncpdt.h"     // registers mapping file
#include "driverlib/interrupt.h"
#include "driverlib/adc.h"

#include "wlan.h"
#include "evnt_handler.h"
#include "nvmem.h"
#include "socket.h"
#include "netapp.h"
#include "spi.h"
#include "hci.h"

#include "dispatcher.h"
#include "spi_version.h"
#include "board.h"
#include "application_version.h"
#include "host_driver_version.h"
#include "security.h"
#include "application_commands.h"

//*****************************************************************************
//! \addtogroup example_list
//! <h1>CC3000 Basic WiFi Example (cc3000_basic_wifi_application)</h1>
//!
//! This is a basic WiFi application for the CC3000 BoosterPack. This
//! application is a command line wrapper for various functions that the
//! CC3000 can provide. Please refer to the CC3000 wiki at
//! http://processors.wiki.ti.com/index.php/CC3000 for more information on
//! the commands provided.
//!
//! To see available commands type ``help'' at the serial terminal prompt.
//! The terminal is connected in 8-N-1 mode at 115200 baud.
//!
//! This example defaults to using BoosterPack2. If you would like to use
//! BoosterPack1 instead please change the define CC3000_USE_BOOSTERPACK2 in
//! the project settings to CC3000_USE_BOOSTERPACK1 and rebuild.
//!
//! To use this example you must first connect to an existing unencrypted
//! wireless network. This can be done by using the ``smartconfig'' command
//! with the associated smartphone application. Alternatively, the connection
//! can be made manually by using the 'connect' command. Once connected you can
//! do any of the following.
//!
//! <b>Configure an IP address:</b>
//!
//! <ol>
//! <li>To use DHCP to allocate a dynamic IP address ``ipconfig'' or
//! ``ipconfig 0 0 0'' or,
//! <li>To allocate a static IP address use ``ipconfig a.b.c.d'' where
//! ``a.b.c.d'' is the required, dotted-decimal format address.
//! </ol>
//!
//! <b>Send and receive UDP data:</b>
//!
//! <ol>
//! <li>Open a UDP socket ``socketopen UDP''.
//! <li>Bind the socket to a local port ``bind 8080''.
//! <li>Send or receive data ``senddata 192.168.1.101 8080 helloworld'' or
//! ``receivedata''.  In the senddata case, the provided parameters identify
//! the IP address of the remote host and the remote port number to which the
//! data is to be sent.
//! </ol>
//!
//! <b>Send and receive TCP data:</b>
//!
//! <ol>
//! <li>Open a TCP socket ``socketopen TCP''.
//! <li>Bind the socket to a local port ``bind 8080''.
//! <li>Send a request to the remote server ``senddata 192.168.1.101 8080
//! helloworld''.  On the first ``senddata'' after opening the socket, the
//! socket is connected to the specified remote host and port.  On further
//! ``senddata'' requests, the remote address and port are ignored and the
//! existing connection is used.
//! <li>Receive data from the remote server ``receivedata''.
//! </ol>
//!
//! Note that, in the current implementation, the application only supports
//! acting as a TCP client.  The CC3000 also supports incoming connections
//! as required to operate as a TCP server but this example does not yet
//! include support for this feature.
//!
//! <b>Send mDNS advertisement:</b>
//!
//! <ol>
//! <li>``mdnsadvertise cc3000''
//! </ol>
//!
//! <b>Close the open socket:</b>
//!
//! <ol>
//! <li>``socketclose''
//! </ol>
//!
//! <b>Disconnect from network:</b>
//!
//! <ol>
//! <li>``disconnect''
//! </ol>
//!
//! <b>Reset the CC3000:</b>
//!
//! <ol>
//! <li>``resetcc3000''
//! </ol>
//!
//! <b>Delete connection policy:</b>
//!
//! This deletes the connection policy from CC3000 memory so that the device
//! won't auto connect whenever it is reset in future.
//!
//! <ol>
//! <li>``deletepolicy''
//! </ol>
//
//*****************************************************************************

#ifdef DEBUG
//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
void
__error__(char *pcFilename, uint32_t ui32Line)
{
    //
    // Tell the user about the error reported.
    //
    UARTprintf("Runtime error at line %d of file %s!\n", ui32Line, pcFilename);

    while(1)
    {
        //
        // Hang here to allow debug.
        //
    }
}
#endif // DEBUG

//*****************************************************************************
//
//  Global variables used by this program for event tracking.
//
//*****************************************************************************
volatile uint32_t g_ui32SmartConfigFinished, g_ui32CC3000Connected,
                  g_ui32CC3000DHCP,g_ui32OkToDoShutDown,
                  g_ui32CC3000DHCP_configured;

//*****************************************************************************
//
// Global to see if socket has been connected to (valid for TCP only)
//
//*****************************************************************************
bool g_bSocketConnected = false;

//*****************************************************************************
//
// Global to turn autonomous mode on/off
//
//*****************************************************************************
static bool autonomousMode = false;

//*****************************************************************************
//
//  Smart Config flag variable. Used to stop Smart Config.
//
//*****************************************************************************
volatile uint8_t g_ui8StopSmartConfig;

//*****************************************************************************
//
// Global socket handle.
//
//*****************************************************************************
volatile uint32_t g_ui32Socket = SENTINEL_EMPTY;

//*****************************************************************************
//
// Global to hold socket type. Rewritten each time 'socketopen' is called.
//
//*****************************************************************************
sockaddr g_tSocketAddr;

//*****************************************************************************
//
// Flag used to signify type of socket, TCP or UDP.
//
//*****************************************************************************
uint32_t g_ui32SocketType = 0;

//*****************************************************************************
//
// Flag used to denote of bind has been called on socket yet
//
//*****************************************************************************
uint32_t g_ui32BindFlag = SENTINEL_EMPTY;

//*****************************************************************************
//
// Simple config prefix
//
//*****************************************************************************
char g_pcCC3000_prefix[] = {'T', 'T', 'T'};

//*****************************************************************************
//
// Input buffer for the command line interpreter.
//
//*****************************************************************************
static char g_cInput[MAX_COMMAND_SIZE];

//*****************************************************************************
//
// Device name used by default for smart config response & mDNS advertising.
//
//*****************************************************************************
char g_pcdevice_name[] = "home_assistant";

//*****************************************************************************
//
// AES key "smartconfigAES16"
//
//*****************************************************************************
const uint8_t g_pui8smartconfigkey[] = {0x73,0x6d,0x61,0x72,0x74,0x63,0x6f,
                                        0x6e,0x66,0x69,0x67,0x41,0x45,0x53,
                                        0x31,0x36};

																				
#define SYSCTL_RCGC0_R          (*((volatile uint32_t *)0x40038000))
																				
//*****************************************************************************
//
// Device name used by default for smart config response & mDNS advertising.
//
//*****************************************************************************
bool socket_opened = false;
//*****************************************************************************
//__no_init is used to prevent the buffer initialization in order to
// prevent hardware WDT expiration  before entering 'main()'.
//for every IDE, different syntax exists :
// __CCS__ for CCS v5
// __IAR_SYSTEMS_ICC__ for IAR Embedded Workbench
//
// Reception from the air, buffer - the max data length  + headers
//
//*****************************************************************************

//
// Code Composer Studio pragmas.
//
#if defined(__CCS__) || defined(ccs)
uint8_t g_pui8CC3000_Rx_Buffer[CC3000_APP_BUFFER_SIZE +
                                            CC3000_RX_BUFFER_OVERHEAD_SIZE];

//
// IAR Codebench, aka ewarm pragmas.
//
#elif defined(__IAR_SYSTEMS_ICC__) || (ewarm)
__no_init uint8_t g_pui8CC3000_Rx_Buffer[CC3000_APP_BUFFER_SIZE +
                                            CC3000_RX_BUFFER_OVERHEAD_SIZE];

//
// Code Sourcery, GCC, and Keil all use the same pragmas.
//
#else
uint8_t g_pui8CC3000_Rx_Buffer[CC3000_APP_BUFFER_SIZE +
                                            CC3000_RX_BUFFER_OVERHEAD_SIZE];
#endif

