RoboEvangelist/TivaWare_C_Series-2.1.0.12573/examples/boards/ek-tm4c1294xl-boost-cc3000/cc3000_basic_wifi_application/cc3000_basic_wifi_application.c
    }
    else
    {
        //
        // Use argument as name.
        //
        UARTprintf("    mdns advertising as: '%s'...\n",argv[1]);
        for(ui32x = 0; ((ui32x < 100) && (i32Check != 0)); ui32x++)
        {
            i32Check = mdnsAdvertiser(1, argv[1], strlen(argv[1]));
        }

    }
    //
    // Check return code.
    //
    if(i32Check == COMMAND_SUCCESS)
    {
        UARTprintf("    mDNS Advertised successfully.\n");
    }
    else
    {
        UARTprintf("    mDNS Advertising failed with error code '%d'\n",
                    i32Check);
    }

    return(0);
}

//*****************************************************************************
//
// Stops and then starts the CC3000 unit. Necessary to apply profiles. Useful
// for restarting sockets and other things.
//
//*****************************************************************************
int
CMD_cc3000reset(int argc, char **argv)
{

    //
    // Reset Sockets, Ports, and all connections
    //
    g_ui32BindFlag = SENTINEL_EMPTY;
    g_ui32Socket = SENTINEL_EMPTY;
    g_ui32SocketType = SENTINEL_EMPTY;

    //
    // Stop the CC3000. No return value provided.
    //
    wlan_stop();

    //
    // Wait a bit
    //
    ROM_SysCtlDelay(100000);

    //
    // Turn off LED3 and turn on LED1.
    //
    turnLedOff(LED3);
    turnLedOn(LED1);

    //
    // Start the CC3000.
    //
    wlan_start(0);
    return(0);
}

//*****************************************************************************
//
// Ping an IP Address
// Arguments:
//  [1] IP address to ping
//  [2] (optional) max number of tries
//  [3] (optional) timeout in milliseconds
//
//*****************************************************************************
int
CMD_ping(int argc, char **argv)
{
    int32_t i32Check = 0;
    uint32_t ui32Tries = 0, ui32Timeout = 0, ui32IP = 0;
    uint8_t ui8IPBlock1, ui8IPBlock2, ui8IPBlock3, ui8IPBlock4;

    //
    // Validate input.
    //
    if(argc <= 1)
    {
        return(CMDLINE_TOO_FEW_ARGS);
    }
    else if(argc > 4)
    {
        return(CMDLINE_TOO_MANY_ARGS);
    }

    //
    // Extract IP address.
    //
    i32Check = DotDecimalDecoder(argv[1], &ui8IPBlock1, &ui8IPBlock2,
                                 &ui8IPBlock3, &ui8IPBlock4);

    //
    // Validate IP address.
    //
    if(i32Check == COMMAND_FAIL)
    {
        UARTprintf("    Invalid IP Address, Please try again.\n");
        return(CMDLINE_INVALID_ARG);
    }
    else
    {
        //
        // Concatenate IP blocks together.
        //
        ui32IP = (ui8IPBlock4 << 24) + (ui8IPBlock3 << 16) +
                 ( ui8IPBlock2 << 8) + (ui8IPBlock1 << 0);

    }

    //
    // Extract the maximum number of tries.
    //
    if(argc >= 3)
    {
        ui32Tries = ustrtoul(argv[2], 0, 10);
    }
    else
    {
        ui32Tries = 4;
    }

    //
    // Extract the timeout.
    //
    if(argc == 4)
    {
        ui32Timeout = ustrtoul(argv[3], 0, 10);
    }
    else
    {
        ui32Timeout = 500;
    }

    //
    // Notify user of settings.
    //
    UARTprintf("    Pinging %d.%d.%d.%d, 0x%x, Max Tries: %d, Timeout: %dms...",
                ui8IPBlock1, ui8IPBlock2, ui8IPBlock3, ui8IPBlock4, ui32IP,
                ui32Tries, ui32Timeout);

    //
    // Send Ping request to CC3000. Set buffer length to 255.
    //
    i32Check = netapp_ping_send((unsigned long *)&ui32IP, ui32Tries, 255,
                                ui32Timeout);

    //
    // Validate that the Ping completed successfully
    //
    if(i32Check != 0)
    {
        UARTprintf("    Ping request failed with error code: '%d'\n", i32Check);
    }

    return(0);
}




void
Interrupt_Init(void)
{
	//
	// Enable Peripheral Clocks 
	//
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);

	//
	// Enable pin PJ0 for GPIOInput (SW2)
	//
	GPIOPinTypeGPIOInput(GPIO_PORTJ_AHB_BASE, GPIO_PIN_1);

	//*************************************************************
	//	The code above is automatically generated by PinMux
	//  The code below should be manually added by the programmer
	//*************************************************************
	
	//Enable pull-up on PJ0
	GPIO_PORTJ_AHB_PUR_R |= 0x02; 
  IntEnable(INT_GPIOJ);  							// enable interrupt 51 in NVIC (GPIOJ)
	IntPrioritySet(INT_GPIOJ, 0x00); 		// configure GPIOJ interrupt priority as 0
	GPIO_PORTJ_AHB_IM_R |= 0x03;   		// arm interrupt on PJ0, PJ1
	GPIO_PORTJ_AHB_IS_R &= ~0x03;     // PJ0, PJ1 are edge-sensitive
  GPIO_PORTJ_AHB_IBE_R &= ~0x03;   	// PJ0, PJ1 not both edges trigger 
  GPIO_PORTJ_AHB_IEV_R &= ~0x03;  // PJ0, PJ1 falling edge event
	//IntMasterEnable();        		// globally enable interrupt
}


//interrupt handler
void GPIOPortJ_Handler(void)
	
{
	int32_t i32CommandStatus;
	//char tcp_char[] = "socketclose TCP";
	
	//SW1 is pressed
	if(GPIO_PORTJ_AHB_RIS_R&0x01)
		//UARTprintf(" sw1 pressed turn on LED ...\n");
	{
		UARTprintf(" sw1 pressed turn on LED ...\n");
		//GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0x02);// turn on the LED
		//i32CommandStatus = CmdLineProcess(tcp_char);      // close a TCP socket
		UARTprintf(" stopping...\n");
		PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, 4000);			// 100% duty cycle PF 2
								PWMPulseWidthSet(PWM0_BASE, PWM_OUT_3, 4000);			// 100% duty cycle
								PWMPulseWidthSet(PWM0_BASE, PWM_OUT_4, 4000);			//100% duty cycle PF 1
								PWMPulseWidthSet(PWM0_BASE, PWM_OUT_5, 4000);			//100% duty cycle	PF 0

	}
	
	
	
}



//*****************************************************************************
//
// main loop
//
//*****************************************************************************
int
main(void)
{
    int32_t i32CommandStatus;

    g_ui32CC3000DHCP = 0;
    g_ui32CC3000Connected = 0;
    g_ui32Socket = SENTINEL_EMPTY;
    g_ui32BindFlag = SENTINEL_EMPTY;
    g_ui32SmartConfigFinished = 0;
		// commands to start the TCP socket
		char tcp_char[] = "socketopen TCP";
	  char bind_char[] = "bind 5005";
		char receive_data[] = "receivedata";
	  int32_t sample[CC3000_APP_BUFFER_SIZE +
                                            CC3000_RX_BUFFER_OVERHEAD_SIZE];
		
		// initialize ports
	  ADC0_InitSWTriggerSeq3_Ch9();
	  Interrupt_Init();
		PortFunctionInit();
		PWMGenConfigure(PWM0_BASE, PWM_GEN_2, PWM_GEN_MODE_DOWN);
		PWMGenPeriodSet(PWM0_BASE, PWM_GEN_2, 4000);
		PWMGenConfigure(PWM0_BASE, PWM_GEN_1, PWM_GEN_MODE_DOWN);
		PWMGenPeriodSet(PWM0_BASE, PWM_GEN_1, 4000);
		PWMOutputState(PWM0_BASE, PWM_OUT_4_BIT, true);
		PWMOutputState(PWM0_BASE, PWM_OUT_5_BIT, true);
		PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, true);
		PWMOutputState(PWM0_BASE, PWM_OUT_3_BIT, true);
		PWMGenEnable(PWM0_BASE, PWM_GEN_2);
		PWMGenEnable(PWM0_BASE, PWM_GEN_1);
	
    //
    // Initialize all board specific components and allow board to connect to the internet.
    //
    initDriver();
		ROM_SysCtlDelay(g_ui32SysClock / 2); // give board some time to load
	
		// initialize socket and start receiving data
		i32CommandStatus = CmdLineProcess(tcp_char);      // open a TCP socket
		i32CommandStatus = CmdLineProcess(bind_char);     // bind to port 5005
		i32CommandStatus = CmdLineProcess(receive_data);  // get data immediately
		//i32CommandStatus = CmdLineProcess("smartconfig");  
    //
    // Loop forever waiting  for commands from PC...
    //
		
