RoboEvangelist/TivaWare_C_Series-2.1.0.12573/examples/boards/ek-tm4c1294xl-boost-cc3000/cc3000_basic_wifi_application/cc3000_basic_wifi_application.c
		//char send_data[] = "senddata 192.168.1.110 5005 h";
    while(1)
    {
			
			
				//
        // Print prompt for user.
        //
        UARTprintf("\n>");
/*
        //
        // Peek to see if a full command is ready for processing
        //
        while(UARTPeek('\r') == -1)
        {
            //
            // 1 millisecond delay.
            //
            ROM_SysCtlDelay(g_ui32SysClock / 3000);
        }

        //
        // A '\r' was detected get the line of text from the user.
        //
        UARTgets(g_cInput,sizeof(g_cInput));
*/
				ROM_SysCtlDelay(40000000);
        //
        // Pass the line from the user to the command processor.
        // It will be parsed and valid commands executed.
        //
        //i32CommandStatus = CmdLineProcess(g_cInput);
				//UARTprintf("%c\n\n", send_data);
//				char send_data[] = "senddata 192.168.1.110 5005 h";
//				i32CommandStatus = CmdLineProcess(send_data);
				// first command makes board connect to wifi (automatic)
				// and then we creat the socket
				// call the bind and socketopen commands
			  //UARTgets(g_cInput,sizeof(g_cInput));

        //
        // Pass the line from the user to the command processor.
        // It will be parsed and valid commands executed.
        // 
//        i32CommandStatus = CmdLineProcess(tcp_char);
//			  i32CommandStatus = CmdLineProcess(bind_char);
/*
        //
        // Handle the case of bad command.
        //
        if(i32CommandStatus == CMDLINE_BAD_CMD)
        {
            UARTprintf("    Bad command. Try again.\n");
        }
        //
        // Handle the case of too many arguments.
        //
        else if(i32CommandStatus == CMDLINE_TOO_MANY_ARGS)
        {
            UARTprintf("    Too many arguments for command. Try again.\n");
        }
        //
        // Handle the case of too few arguments.
        //
        else if(i32CommandStatus == CMDLINE_TOO_FEW_ARGS)
        {
            UARTprintf("    Too few arguments for command. Try again.\n");
        }
        //
        // Handle the case of too few arguments.
        //
        else if(i32CommandStatus == CMDLINE_INVALID_ARG)
        {
            UARTprintf("    Invalid command argument(s). Try again.\n");
        }
*/
        //
        // Complete smart config process:
        // 1. if smart config is done
        // 2. CC3000 established AP connection
        // 3. DHCP IP is configured
        // then send mDNS packet to stop external SmartConfig application
        //
        if((g_ui8StopSmartConfig == 1) && (g_ui32CC3000DHCP == 1) &&
           (g_ui32CC3000Connected == 1))
        {
            unsigned char loop_index = 0;

            while(loop_index < 3)
            {
                mdnsAdvertiser(1, g_pcdevice_name, sizeof(g_pcdevice_name));
                loop_index++;
            }

            g_ui8StopSmartConfig = 0;
        }
    }
}
